using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using DxLibDLL;

namespace SyobonAction
{
    static partial class Program
    {
        static void Stage()
        {
            //1-1
            if (nステージa == 1 && nステージb == 1 && nステージc == 0)
            {

                var stagedatex = MapList.stagedatex1;


                //追加情報
                tyobi(8 * 29, 9 * 29 - 12, 100);
                nブロック[nブロックco].xtype = 2;

                tyobi(13 * 29, 9 * 29 - 12, 102);
                nブロック[nブロックco].xtype = 0;

                tyobi(14 * 29, 5 * 29 - 12, 101);

                tyobi(35 * 29, 8 * 29 - 12, 110);

                tyobi(47 * 29, 9 * 29 - 12, 103);

                tyobi(59 * 29, 9 * 29 - 12, 112);

                tyobi(67 * 29, 9 * 29 - 12, 104);


                n地面co = 0;
                int t_ = n地面co;
                n地面[t_].a = 20 * 29 * 100 + 500;
                n地面[t_].b = -6000;
                n地面[t_].c = 5000;
                n地面[t_].d = 70000;
                n地面[t_].type = 100;
                n地面co++;

                t_ = n地面co;
                n地面[t_].a = 54 * 29 * 100 - 500;
                n地面[t_].b = -6000;
                n地面[t_].c = 7000;
                n地面[t_].d = 70000;
                n地面[t_].type = 101;
                n地面co++;

                t_ = n地面co;
                n地面[t_].a = 112 * 29 * 100 + 1000;
                n地面[t_].b = -6000;
                n地面[t_].c = 3000;
                n地面[t_].d = 70000;
                n地面[t_].type = 102;
                n地面co++;

                t_ = n地面co;
                n地面[t_].a = 117 * 29 * 100;
                n地面[t_].b = (2 * 29 - 12) * 100 - 1500;
                n地面[t_].c = 15000;
                n地面[t_].d = 3000;
                n地面[t_].type = 103;
                n地面co++;

                t_ = n地面co;
                n地面[t_].a = 125 * 29 * 100;
                n地面[t_].b = -6000;
                n地面[t_].c = 9000;
                n地面[t_].d = 70000;
                n地面[t_].type = 101;
                n地面co++;

                t_ = 28;
                n地面[t_].a = 29 * 29 * 100 + 500;
                n地面[t_].b = (9 * 29 - 12) * 100;
                n地面[t_].c = 6000;
                n地面[t_].d = 12000 - 200;
                n地面[t_].type = 50;
                n地面co++;

                t_ = n地面co;
                n地面[t_].a = 49 * 29 * 100;
                n地面[t_].b = (5 * 29 - 12) * 100;
                n地面[t_].c = 9000 - 1;
                n地面[t_].d = 3000;
                n地面[t_].type = 51;
                n地面[t_].gtype = 0;
                n地面co++;

                t_ = n地面co;
                n地面[t_].a = 72 * 29 * 100;
                n地面[t_].b = (13 * 29 - 12) * 100;
                n地面[t_].c = 3000 * 5 - 1;
                n地面[t_].d = 3000;
                n地面[t_].type = 52;
                n地面co++;

                n敵出現co = 0;
                t_ = n敵出現co;
                n敵出現[t_].a = 27 * 29 * 100;
                n敵出現[t_].b = (9 * 29 - 12) * 100;
                n敵出現[t_].type = 0;
                n敵出現[t_].xtype = 0;
                n敵出現co++;

                t_ = n敵出現co;
                n敵出現[t_].a = 103 * 29 * 100;
                n敵出現[t_].b = (5 * 29 - 12 + 10) * 100;
                n敵出現[t_].type = 80;
                n敵出現[t_].xtype = 0;
                n敵出現co++;


                for (int tt_ = 0; tt_ <= 1000; tt_++)
                {
                    for (int i = 0; i <= 16; i++)
                    {
                        stageDate[i, tt_] = 0; stageDate[i, tt_] = stagedatex[i,tt_];
                    }
                }

            }//sta1


            //1-2(地上)
            if (nステージa == 1 && nステージb == 2 && nステージc == 0)
            {

                //マリ　地上　入れ
                bgmChange(Res.nオーディオ100);

                scrollX = 0 * 100;

                var stagedatex = MapList.stagedatex2;



                nブロックco = 0;
                //ヒント1
                nブロック[nブロックco].xtype = 1; tyobi(4 * 29, 9 * 29 - 12, 300);

                //毒1
                tyobi(13 * 29, 8 * 29 - 12, 114);

                //t=28;
                n地面co = 0;
                int t_ = n地面co; n地面[t_].a = 14 * 29 * 100 + 500; n地面[t_].b = (9 * 29 - 12) * 100; n地面[t_].c = 6000; n地面[t_].d = 12000 - 200; n地面[t_].type = 50; n地面[t_].xtype = 1; n地面co++;
                t_ = n地面co; n地面[t_].a = 12 * 29 * 100; n地面[t_].b = (11 * 29 - 12) * 100; n地面[t_].c = 3000; n地面[t_].d = 6000 - 200; n地面[t_].type = 40; n地面[t_].xtype = 0; n地面co++;
                t_ = n地面co; n地面[t_].a = 14 * 29 * 100 + 1000; n地面[t_].b = -6000; n地面[t_].c = 5000; n地面[t_].d = 70000; n地面[t_].type = 100; n地面[t_].xtype = 1; n地面co++;
                //ブロックもどき


                for (int tt_ = 0; tt_ <= 1000; tt_++)
                {
                    for (int i = 0; i <= 16; i++)
                    {
                        stageDate[i, tt_] = 0; stageDate[i, tt_] = stagedatex[i,tt_];
                    }
                }

            }//sta2


            //1-2-1(地下)
            if (nステージa == 1 && nステージb == 2 && nステージc == 1)
            {

                //マリ　地下　入れ
                bgmChange(Res.nオーディオ103);

                scrollX = 4080 * 100;
                ma = 6000; nプレイヤー.b = 3000;
                nステージ色 = 2;


                var stagedatex = MapList.stagedatex3;



                nブロックco = 0;
                nブロック[nブロックco].xtype = 2; tyobi(7 * 29, 9 * 29 - 12, 102);

                tyobi(10 * 29, 9 * 29 - 12, 101);

                nブロック[nブロックco].xtype = 2;

                tyobi(49 * 29, 9 * 29 - 12, 114);

                for (int i = 0; i >= -7; i--)
                {

                    tyobi(53 * 29, i * 29 - 12, 1);
                }

                nブロック[nブロックco].xtype = 1; tyobi(80 * 29, 5 * 29 - 12, 104);
                nブロック[nブロックco].xtype = 2; tyobi(78 * 29, 5 * 29 - 12, 102);


                n地面co = 0;
                int t_ = n地面co; n地面[t_].a = 2 * 29 * 100; n地面[t_].b = (13 * 29 - 12) * 100; n地面[t_].c = 3000 * 1 - 1; n地面[t_].d = 3000; n地面[t_].type = 52; n地面co++;
                t_ = n地面co; n地面[t_].a = 24 * 29 * 100; n地面[t_].b = (13 * 29 - 12) * 100; n地面[t_].c = 3000 * 1 - 1; n地面[t_].d = 3000; n地面[t_].type = 52; n地面co++;
                t_ = n地面co; n地面[t_].a = 43 * 29 * 100 + 500; n地面[t_].b = -6000; n地面[t_].c = 3000; n地面[t_].d = 70000; n地面[t_].type = 102; n地面[t_].xtype = 1; n地面co++;
                t_ = n地面co; n地面[t_].a = 53 * 29 * 100 + 500; n地面[t_].b = -6000; n地面[t_].c = 3000; n地面[t_].d = 70000; n地面[t_].type = 102; n地面[t_].xtype = 2; n地面co++;
                t_ = n地面co; n地面[t_].a = 129 * 29 * 100; n地面[t_].b = (7 * 29 - 12) * 100; n地面[t_].c = 3000; n地面[t_].d = 6000 - 200; n地面[t_].type = 40; n地面[t_].xtype = 2; n地面co++;
                t_ = n地面co; n地面[t_].a = 154 * 29 * 100; n地面[t_].b = 3000; n地面[t_].c = 9000; n地面[t_].d = 3000; n地面[t_].type = 102; n地面[t_].xtype = 7; n地面co++;

                //ブロックもどき

                t_ = 27; n地面[t_].a = 69 * 29 * 100; n地面[t_].b = (1 * 29 - 12) * 100; n地面[t_].c = 9000 * 2 - 1; n地面[t_].d = 3000; n地面[t_].type = 51; n地面[t_].xtype = 0; n地面[t_].gtype  = 0; n地面co++;
                t_ = 28; n地面[t_].a = 66 * 29 * 100; n地面[t_].b = (1 * 29 - 12) * 100; n地面[t_].c = 9000 - 1; n地面[t_].d = 3000; n地面[t_].type = 51; n地面[t_].xtype = 1; n地面[t_].gtype  = 0; n地面co++;
                t_ = 29; n地面[t_].a = 66 * 29 * 100; n地面[t_].b = (-2 * 29 - 12) * 100; n地面[t_].c = 9000 * 3 - 1; n地面[t_].d = 3000; n地面[t_].type = 51; n地面[t_].xtype = 2; n地面[t_].gtype  = 0; n地面co++;

                //26 ファイアー土管
                t_ = 26; n地面[t_].a = 103 * 29 * 100 - 1500; n地面[t_].b = (9 * 29 - 12) * 100 - 2000; n地面[t_].c = 3000; n地面[t_].d = 3000; n地面[t_].type = 180; n地面[t_].xtype = 0; n地面[t_].r = 0; n地面[t_].gtype  = 48; n地面co++;
                t_ = n地面co; n地面[t_].a = 102 * 29 * 100; n地面[t_].b = (9 * 29 - 12) * 100; n地面[t_].c = 6000; n地面[t_].d = 12000 - 200; n地面[t_].type = 50; n地面[t_].xtype = 2; n地面co++;
                t_ = n地面co; n地面[t_].a = 123 * 29 * 100; n地面[t_].b = (9 * 29 - 12) * 100; n地面[t_].c = 3000 * 5 - 1; n地面[t_].d = 3000 * 5; n地面[t_].type = 52; n地面[t_].xtype = 1; n地面co++;

                t_ = n地面co; n地面[t_].a = 131 * 29 * 100; n地面[t_].b = (1 * 29 - 12) * 100; n地面[t_].c = 4700; n地面[t_].d = 3000 * 8 - 700; n地面[t_].type = 1; n地面[t_].xtype = 0; n地面co++;

                //オワタゾーン
                t_ = n地面co; n地面[t_].a = 143 * 29 * 100; n地面[t_].b = (9 * 29 - 12) * 100; n地面[t_].c = 6000; n地面[t_].d = 12000 - 200; n地面[t_].type = 50; n地面[t_].xtype = 5; n地面co++;
                t_ = n地面co; n地面[t_].a = 148 * 29 * 100; n地面[t_].b = (9 * 29 - 12) * 100; n地面[t_].c = 6000; n地面[t_].d = 12000 - 200; n地面[t_].type = 50; n地面[t_].xtype = 5; n地面co++;
                t_ = n地面co; n地面[t_].a = 153 * 29 * 100; n地面[t_].b = (9 * 29 - 12) * 100; n地面[t_].c = 6000; n地面[t_].d = 12000 - 200; n地面[t_].type = 50; n地面[t_].xtype = 5; n地面co++;



                n敵出現co = 0;
                t_ = n敵出現co; n敵出現[t_].a = 18 * 29 * 100; n敵出現[t_].b = (10 * 29 - 12) * 100; n敵出現[t_].type = 82; n敵出現[t_].xtype = 1; n敵出現co++;
                t_ = n敵出現co; n敵出現[t_].a = 51 * 29 * 100 + 1000; n敵出現[t_].b = (2 * 29 - 12 + 10) * 100; n敵出現[t_].type = 80; n敵出現[t_].xtype = 1; n敵出現co++;

                //？ボール
                t_ = n敵出現co; n敵出現[t_].a = 96 * 29 * 100 + 100; n敵出現[t_].b = (10 * 29 - 12) * 100; n敵出現[t_].type = 105; n敵出現[t_].xtype = 0; n敵出現co++;


                //リフト
                nリフトco = 0;
                t_ = nリフトco; nリフト[t_].a = 111 * 29 * 100; nリフト[t_].b = (8 * 29 - 12) * 100; nリフト[t_].c = 90 * 100; nリフト[t_].type = 0; nリフト[t_].acttype = 5; nリフト[t_].e = -300; nリフトco++;
                t_ = nリフトco; nリフト[t_].a = 111 * 29 * 100; nリフト[t_].b = (0 * 29 - 12) * 100; nリフト[t_].c = 90 * 100; nリフト[t_].type = 0; nリフト[t_].acttype = 5; nリフト[t_].e = -300; nリフトco++;
                t_ = 10; nリフト[t_].a = 116 * 29 * 100; nリフト[t_].b = (4 * 29 - 12) * 100; nリフト[t_].c = 90 * 100; nリフト[t_].type = 1; nリフト[t_].acttype = 5; nリフト[t_].e = 300; nリフトco++;
                t_ = 11; nリフト[t_].a = 116 * 29 * 100; nリフト[t_].b = (12 * 29 - 12) * 100; nリフト[t_].c = 90 * 100; nリフト[t_].type = 1; nリフト[t_].acttype = 5; nリフト[t_].e = 300; nリフトco++;



                for (int tt_ = 0; tt_ <= 1000; tt_++)
                {
                    for (int i = 0; i <= 16; i++)
                    {
                        stageDate[i, tt_] = 0; stageDate[i, tt_] = stagedatex[i,tt_];
                    }
                }

            }//sta1-2-1




            //1-2(地上)
            if (nステージa == 1 && nステージb == 2 && nステージc == 2)
            {

                //マリ　地上　入れ
                bgmChange(Res.nオーディオ100);

                scrollX = 900 * 100;
                ma = 7500; nプレイヤー.b = 3000 * 9;

                var stagedatex = MapList.stagedatex4;

                int t_ = n地面co; n地面[t_].a = 5 * 29 * 100 + 500; n地面[t_].b = -6000; n地面[t_].c = 3000; n地面[t_].d = 70000; n地面[t_].type = 102; n地面[t_].xtype = 8; n地面co++;
                //空飛ぶ土管
                t_ = 28; n地面[t_].a = 44 * 29 * 100 + 500; n地面[t_].b = (10 * 29 - 12) * 100; n地面[t_].c = 6000; n地面[t_].d = 9000 - 200; n地面[t_].type = 50; n地面co++;

                //ポールもどき
                n敵出現co = 0;
                t_ = n敵出現co; n敵出現[t_].a = 19 * 29 * 100; n敵出現[t_].b = (2 * 29 - 12) * 100; n敵出現[t_].type = 85; n敵出現[t_].xtype = 0; n敵出現co++;


                for (int tt_ = 0; tt_ <= 1000; tt_++)
                {
                    for (int i = 0; i <= 16; i++)
                    {
                        stageDate[i, tt_] = 0; stageDate[i, tt_] = stagedatex[i,tt_];
                    }
                }

            }//sta2



            //必要BGM+SE

            //1-3(地上)
            if (nステージa == 1 && nステージb == 3 && nステージc == 6) { nステージc = 0; }
            if (nステージa == 1 && nステージb == 3 && nステージc == 0)
            {
                bgmChange(Res.nオーディオ100);

                scrollX = 3900 * 100;
                //ma=3000;mb=3000;

                var stagedatex = MapList.stagedatex5;

                nブロックco = 0;

                tyobi(22 * 29, 3 * 29 - 12, 1);
                //毒1
                tyobi(54 * 29, 9 * 29 - 12, 116);
                //音符+
                tyobi(18 * 29, 14 * 29 - 12, 117);

                tyobi(19 * 29, 14 * 29 - 12, 117);

                tyobi(20 * 29, 14 * 29 - 12, 117);
                nブロック[nブロックco].xtype = 1; tyobi(61 * 29, 9 * 29 - 12, 101);//5

                tyobi(74 * 29, 9 * 29 - 12, 7);//6

                //ヒント2
                nブロック[nブロックco].xtype = 2; tyobi(28 * 29, 9 * 29 - 12, 300);//7
                                                                  //ファイア
                nブロック[nブロックco].xtype = 3; tyobi(7 * 29, 9 * 29 - 12, 101);
                //ヒント3
                nブロック[nブロックco].xtype = 4; tyobi(70 * 29, 8 * 29 - 12, 300);//9

                //もろいぶろっく×３
                nブロック[nブロックco].xtype = 1; tyobi(58 * 29, 13 * 29 - 12, 115);
                nブロック[nブロックco].xtype = 1; tyobi(59 * 29, 13 * 29 - 12, 115);
                nブロック[nブロックco].xtype = 1; tyobi(60 * 29, 13 * 29 - 12, 115);

                //ヒントブレイク
                nブロック[nブロックco].xtype = 0; tyobi(111 * 29, 6 * 29 - 12, 301);
                //ジャンプ
                nブロック[nブロックco].xtype = 0; tyobi(114 * 29, 9 * 29 - 12, 120);

                //ファイア
                n敵出現co = 0;
                int t_ = n敵出現co; n敵出現[t_].a = 101 * 29 * 100; n敵出現[t_].b = (5 * 29 - 12) * 100; n敵出現[t_].type = 4; n敵出現[t_].xtype = 1; n敵出現co++;
                t_ = n敵出現co; n敵出現[t_].a = 146 * 29 * 100; n敵出現[t_].b = (10 * 29 - 12) * 100; n敵出現[t_].type = 6; n敵出現[t_].xtype = 1; n敵出現co++;

                t_ = n地面co; n地面[t_].a = 9 * 29 * 100; n地面[t_].b = (13 * 29 - 12) * 100; n地面[t_].c = 9000 - 1; n地面[t_].d = 3000; n地面[t_].type = 52; n地面co++;

                //土管
                t_ = n地面co; n地面[t_].a = 65 * 29 * 100 + 500; n地面[t_].b = (10 * 29 - 12) * 100; n地面[t_].c = 6000; n地面[t_].d = 9000 - 200; n地面[t_].type = 50; n地面[t_].xtype = 1; n地面co++;

                //トラップ
                t_ = n地面co; n地面[t_].a = 74 * 29 * 100; n地面[t_].b = (8 * 29 - 12) * 100 - 1500; n地面[t_].c = 6000; n地面[t_].d = 3000; n地面[t_].type = 103; n地面[t_].xtype = 1; n地面co++;
                t_ = n地面co; n地面[t_].a = 96 * 29 * 100 - 3000; n地面[t_].b = -6000; n地面[t_].c = 9000; n地面[t_].d = 70000; n地面[t_].type = 102; n地面[t_].xtype = 10; n地面co++;
                //ポール砲
                t_ = n地面co; n地面[t_].a = 131 * 29 * 100 - 1500; n地面[t_].b = (1 * 29 - 12) * 100 - 3000; n地面[t_].c = 15000; n地面[t_].d = 14000; n地面[t_].type = 104; n地面co++;


                //？ボール
                t_ = n敵出現co; n敵出現[t_].a = 10 * 29 * 100 + 100; n敵出現[t_].b = (11 * 29 - 12) * 100; n敵出現[t_].type = 105; n敵出現[t_].xtype = 1; n敵出現co++;
                //ブロックもどき
                t_ = n敵出現co; n敵出現[t_].a = 43 * 29 * 100; n敵出現[t_].b = (11 * 29 - 12) * 100; n敵出現[t_].type = 82; n敵出現[t_].xtype = 1; n敵出現co++;
                //うめぇ
                t_ = n敵出現co; n敵出現[t_].a = 1 * 29 * 100; n敵出現[t_].b = (2 * 29 - 12 + 10) * 100 - 1000; n敵出現[t_].type = 80; n敵出現[t_].xtype = 0; n敵出現co++;


                //リフト
                nリフトco = 0;
                t_ = nリフトco; nリフト[t_].a = 33 * 29 * 100; nリフト[t_].b = (3 * 29 - 12) * 100; nリフト[t_].c = 90 * 100; nリフト[t_].type = 0; nリフト[t_].acttype = 0; nリフト[t_].e = 0; nリフト[t_].sp = 1; nリフトco++;
                t_ = nリフトco; nリフト[t_].a = 39 * 29 * 100 - 2000; nリフト[t_].b = (6 * 29 - 12) * 100; nリフト[t_].c = 90 * 100; nリフト[t_].type = 0; nリフト[t_].acttype = 1; nリフト[t_].e = 0; nリフトco++;
                t_ = nリフトco; nリフト[t_].a = 45 * 29 * 100 + 1500; nリフト[t_].b = (10 * 29 - 12) * 100; nリフト[t_].c = 90 * 100; nリフト[t_].type = 0; nリフト[t_].acttype = 0; nリフト[t_].e = 0; nリフト[t_].sp = 2; nリフトco++;

                t_ = nリフトco; nリフト[t_].a = 95 * 29 * 100; nリフト[t_].b = (7 * 29 - 12) * 100; nリフト[t_].c = 180 * 100; nリフト[t_].type = 0; nリフト[t_].acttype = 0; nリフト[t_].e = 0; nリフト[t_].sp = 10; nリフトco++;
                t_ = nリフトco; nリフト[t_].a = 104 * 29 * 100; nリフト[t_].b = (9 * 29 - 12) * 100; nリフト[t_].c = 90 * 100; nリフト[t_].type = 0; nリフト[t_].acttype = 0; nリフト[t_].e = 0; nリフト[t_].sp = 12; nリフトco++;
                t_ = nリフトco; nリフト[t_].a = 117 * 29 * 100; nリフト[t_].b = (3 * 29 - 12) * 100; nリフト[t_].c = 90 * 100; nリフト[t_].type = 0; nリフト[t_].acttype = 1; nリフト[t_].e = 0; nリフト[t_].sp = 15; nリフトco++;
                t_ = nリフトco; nリフト[t_].a = 124 * 29 * 100; nリフト[t_].b = (5 * 29 - 12) * 100; nリフト[t_].c = 210 * 100; nリフト[t_].type = 0; nリフト[t_].acttype = 0; nリフト[t_].e = 0; nリフト[t_].sp = 10; nリフトco++;



                if (stagepoint) { stagepoint = false; ma = 4500; nプレイヤー.b = -3000; n中間フラグ = 0; }


                for (int tt_ = 0; tt_ <= 1000; tt_++)
                {
                    for (int i = 0; i <= 16; i++)
                    {
                        stageDate[i, tt_] = 0; stageDate[i, tt_] = stagedatex[i,tt_];
                    }
                }

            }//sta3



            //1-3(地下)
            if (nステージa == 1 && nステージb == 3 && nステージc == 1)
            {

                //マリ　地上　入れ
                bgmChange(Res.nオーディオ103);

                scrollX = 0 * 100;
                ma = 6000; nプレイヤー.b = 6000;
                nステージ色 = 2;


                var stagedatex = MapList.stagedatex6;


                nブロックco = 0;

                nステージc = 0;


                for (int tt_ = 0; tt_ <= 1000; tt_++)
                {
                    for (int t_ = 0; t_ <= 16; t_++)
                    {
                        stageDate[t_, tt_] = 0; stageDate[t_, tt_] = stagedatex[t_,tt_];
                    }
                }

            }//sta3



            //1-3(空中)
            if (nステージa == 1 && nステージb == 3 && nステージc == 5)
            {

                nステージ色 = 3;

                bgmChange(Res.nオーディオ104);

                scrollX = 0 * 100;
                ma = 3000; nプレイヤー.b = 33000;

                stagepoint = true;

                var stagedatex = MapList.stagedatex7;

                n地面co = 0;
                int t_ = n地面co; n地面[t_].a = 14 * 29 * 100 - 5; n地面[t_].b = (11 * 29 - 12) * 100; n地面[t_].c = 6000; n地面[t_].d = 15000 - 200; n地面[t_].type = 50; n地面[t_].xtype = 1; n地面co++;


                nブロック[nブロックco].xtype = 0; tyobi(12 * 29, 4 * 29 - 12, 112);
                //ヒント3
                nブロック[nブロックco].xtype = 3; tyobi(12 * 29, 8 * 29 - 12, 300);

                for (int tt_ = 0; tt_ <= 1000; tt_++)
                {
                    for (int i = 0; i <= 16; i++)
                    {
                        stageDate[i, tt_] = 0; stageDate[i, tt_] = stagedatex[i,tt_];
                    }
                }

            }//sta5

            //1-4(地下)
            if (nステージa == 1 && nステージb == 4 && nステージc == 0)
            {

                //マリ　地上　入れ
                bgmChange(Res.nオーディオ105);

                scrollX = 4400 * 100;
                ma = 12000; nプレイヤー.b = 6000;
                nステージ色 = 4;


                var stagedatex = MapList.stagedatex8;

                n地面co = 0;//sco=140;
                int t_ = n地面co; n地面[t_].a = 35 * 29 * 100 - 1500 + 750; n地面[t_].b = (8 * 29 - 12) * 100 - 1500; n地面[t_].c = 1500; n地面[t_].d = 3000; n地面[t_].type = 105; n地面co++;
                t_ = n地面co; n地面[t_].a = 67 * 29 * 100; n地面[t_].b = (4 * 29 - 12) * 100; n地面[t_].c = 9000 - 1; n地面[t_].d = 3000 * 1 - 1; n地面[t_].type = 51; n地面[t_].xtype = 3; n地面[t_].gtype  = 0; n地面co++;
                t_ = n地面co; n地面[t_].a = 73 * 29 * 100; n地面[t_].b = (13 * 29 - 12) * 100; n地面[t_].c = 3000 * 1 - 1; n地面[t_].d = 3000; n地面[t_].type = 52; n地面co++;
                t_ = n地面co; n地面[t_].a = 123 * 29 * 100; n地面[t_].b = (1 * 29 - 12) * 100; n地面[t_].c = 30 * 6 * 100 - 1 + 0; n地面[t_].d = 3000 - 200; n地面[t_].type = 51; n地面[t_].xtype = 10; n地面co++;
                //スクロール消し
                t_ = n地面co; n地面[t_].a = 124 * 29 * 100 + 3000; n地面[t_].b = (2 * 29 - 12) * 100; n地面[t_].c = 3000 * 1 - 1; n地面[t_].d = 300000; n地面[t_].type = 102; n地面[t_].xtype = 20; n地面co++;
                t_ = n地面co; n地面[t_].a = 148 * 29 * 100 + 1000; n地面[t_].b = (-12 * 29 - 12) * 100; n地面[t_].c = 3000 * 1 - 1; n地面[t_].d = 300000; n地面[t_].type = 102; n地面[t_].xtype = 30; n地面co++;

                //3連星
                t_ = n地面co; n地面[t_].a = 100 * 29 * 100 + 1000; n地面[t_].b = -6000; n地面[t_].c = 3000; n地面[t_].d = 70000; n地面[t_].type = 102; n地面[t_].xtype = 12; n地面co++;

                //地面1
                t_ = n地面co; n地面[t_].a = 0 * 29 * 100 - 0; n地面[t_].b = 9 * 29 * 100 + 1700; n地面[t_].c = 3000 * 7 - 1; n地面[t_].d = 3000 * 5 - 1; n地面[t_].type = 200; n地面[t_].xtype = 0; n地面co++;
                t_ = n地面co; n地面[t_].a = 11 * 29 * 100; n地面[t_].b = -1 * 29 * 100 + 1700; n地面[t_].c = 3000 * 8 - 1; n地面[t_].d = 3000 * 4 - 1; n地面[t_].type = 200; n地面[t_].xtype = 0; n地面co++;


                n敵出現co = 0;
                t_ = n敵出現co; n敵出現[t_].a = 8 * 29 * 100 - 1400; n敵出現[t_].b = (2 * 29 - 12) * 100 + 500; n敵出現[t_].type = 86; n敵出現[t_].xtype = 0; n敵出現co++;
                t_ = n敵出現co; n敵出現[t_].a = 42 * 29 * 100 - 1400; n敵出現[t_].b = (-2 * 29 - 12) * 100 + 500; n敵出現[t_].type = 86; n敵出現[t_].xtype = 0; n敵出現co++;
                t_ = n敵出現co; n敵出現[t_].a = 29 * 29 * 100 + 1500; n敵出現[t_].b = (7 * 29 - 12) * 100 + 1500; n敵出現[t_].type = 87; n敵出現[t_].xtype = 105; n敵出現co++;
                t_ = n敵出現co; n敵出現[t_].a = 47 * 29 * 100 + 1500; n敵出現[t_].b = (9 * 29 - 12) * 100 + 1500; n敵出現[t_].type = 87; n敵出現[t_].xtype = 110; n敵出現co++;
                t_ = n敵出現co; n敵出現[t_].a = 70 * 29 * 100 + 1500; n敵出現[t_].b = (9 * 29 - 12) * 100 + 1500; n敵出現[t_].type = 87; n敵出現[t_].xtype = 105; n敵出現co++;
                t_ = n敵出現co; n敵出現[t_].a = 66 * 29 * 100 + 1501; n敵出現[t_].b = (4 * 29 - 12) * 100 + 1500; n敵出現[t_].type = 87; n敵出現[t_].xtype = 101; n敵出現co++;
                t_ = n敵出現co; n敵出現[t_].a = 85 * 29 * 100 + 1501; n敵出現[t_].b = (4 * 29 - 12) * 100 + 1500; n敵出現[t_].type = 87; n敵出現[t_].xtype = 105; n敵出現co++;

                //ステルスうめぇ
                t_ = n敵出現co; n敵出現[t_].a = 57 * 29 * 100; n敵出現[t_].b = (2 * 29 - 12 + 10) * 100 - 500; n敵出現[t_].type = 80; n敵出現[t_].xtype = 1; n敵出現co++;
                //ブロックもどき
                t_ = n敵出現co; n敵出現[t_].a = 77 * 29 * 100; n敵出現[t_].b = (5 * 29 - 12) * 100; n敵出現[t_].type = 82; n敵出現[t_].xtype = 2; n敵出現co++;
                //ボス
                t_ = n敵出現co; n敵出現[t_].a = 130 * 29 * 100; n敵出現[t_].b = (8 * 29 - 12) * 100; n敵出現[t_].type = 30; n敵出現[t_].xtype = 0; n敵出現co++;
                //クックル
                t_ = n敵出現co; n敵出現[t_].a = 142 * 29 * 100; n敵出現[t_].b = (10 * 29 - 12) * 100; n敵出現[t_].type = 31; n敵出現[t_].xtype = 0; n敵出現co++;

                //マグマ
                n背景co = 0;
                n背景[n背景co].a = 7 * 29 * 100 - 300;
                n背景[n背景co].b = 14 * 29 * 100 - 1200;
                n背景[n背景co].type = 6;
                n背景co++;
                if (n背景co >= n背景max) n背景co = 0;

                n背景[n背景co].a = 41 * 29 * 100 - 300;
                n背景[n背景co].b = 14 * 29 * 100 - 1200;
                n背景[n背景co].type = 6;
                n背景co++;

                if (n背景co >= n背景max) n背景co = 0;
                n背景[n背景co].a = 149 * 29 * 100 - 1100;
                n背景[n背景co].b = 10 * 29 * 100 - 600;
                //TODO 100を代入しているからマグマステージで例外が出る
                n背景[n背景co].type = 100;
                n背景co++;
                if (n背景co >= n背景max) n背景co = 0;

                nブロックco = 0;
                //ON-OFFブロック
                nブロック[nブロックco].xtype = 1; tyobi(29 * 29, 3 * 29 - 12, 130);
                //1-2
                tyobi(34 * 29, 9 * 29 - 12, 5);

                tyobi(35 * 29, 9 * 29 - 12, 5);
                //隠し
                tyobi(55 * 29 + 15, 6 * 29 - 12, 7);
                //隠しON-OFF
                nブロック[nブロックco].xtype = 10; tyobi(50 * 29, 9 * 29 - 12, 114);
                //ヒント3
                nブロック[nブロックco].xtype = 5; tyobi(1 * 29, 5 * 29 - 12, 300);
                //ファイア
                nブロック[nブロックco].xtype = 3;

                tyobi(86 * 29, 9 * 29 - 12, 101);
                //キノコなし　普通
                //音符
                nブロック[nブロックco].xtype = 2;

                tyobi(86 * 29, 6 * 29 - 12, 117);

                //もろいぶろっく×３
                for (int i = 0; i <= 2; i++)
                {
                    nブロック[nブロックco].xtype = 3; tyobi((79 + i) * 29, 13 * 29 - 12, 115);
                }

                //ジャンプ
                nブロック[nブロックco].xtype = 3; tyobi(105 * 29, 11 * 29 - 12, 120);
                //毒1
                nブロック[nブロックco].xtype = 3; tyobi(109 * 29, 7 * 29 - 12, 102);
                //デフラグ
                nブロック[nブロックco].xtype = 4; tyobi(111 * 29, 7 * 29 - 12, 101);
                //剣
                tyobi(132 * 29, 8 * 29 - 12 - 3, 140);

                tyobi(131 * 29, 9 * 29 - 12, 141);
                //メロン
                tyobi(161 * 29, 12 * 29 - 12, 142);
                //ファイアバー強化
                tyobi(66 * 29, 4 * 29 - 12, 124);


                //リフト
                nリフトco = 0;
                t_ = nリフトco; nリフト[t_].a = 93 * 29 * 100; nリフト[t_].b = (10 * 29 - 12) * 100; nリフト[t_].c = 60 * 100; nリフト[t_].type = 0; nリフト[t_].acttype = 1; nリフト[t_].e = 0; nリフトco++;
                t_ = 20; nリフト[t_].a = 119 * 29 * 100 + 300; nリフト[t_].b = (10 * 29 - 12) * 100; nリフト[t_].c = 12 * 30 * 100 + 1000; nリフト[t_].type = 0; nリフト[t_].acttype = 0; nリフト[t_].sp = 21; nリフト[t_].e = 0; nリフトco++;


                nステージc = 0;


                for (int tt_ = 0; tt_ <= 1000; tt_++)
                {
                    for (t_ = 0; t_ <= 16; t_++)
                    {
                        stageDate[t_, tt_] = 0; stageDate[t_, tt_] = stagedatex[t_,tt_];
                    }
                }

            }//sta4

            if (nステージa == 2 && nステージb == 1 && nステージc == 0)
            {// 2-1
                ma = 5600;
                nプレイヤー.b = 32000;

                bgmChange(Res.nオーディオ100);
                nステージ色 = 1;
                scrollX = 2900 * (113 - 19);
                //
                var stagedatex = MapList.stagedatex9;
                //追加情報
                nブロックco = 0;
                //
                nブロック[nブロックco].xtype = 6;

                tyobi(1 * 29, 9 * 29 - 12, 300);
                nブロックco += 1;
                //
                nブロック[nブロックco].xtype = 0;

                tyobi(40 * 29, 9 * 29 - 12, 110);
                nブロックco += 1;
                //
                nブロック[nブロックco].xtype = 7;

                tyobi(79 * 29, 7 * 29 - 12, 300);
                nブロックco += 1;
                //
                nブロック[nブロックco].xtype = 2;

                tyobi(83 * 29, 7 * 29 - 12, 102);
                nブロックco += 1;
                //
                nブロック[nブロックco].xtype = 0;

                tyobi(83 * 29, 2 * 29 - 12, 114);
                nブロックco += 1;
                //
                for (int i = -1; i > -7; i -= 1)
                {

                    tyobi(85 * 29, i * 29 - 12, 4);
                    nブロックco += 1;
                }
                //
                n地面co = 0;
                n地面[n地面co].a = 30 * 29 * 100;
                n地面[n地面co].b = (13 * 29 - 12) * 100;
                n地面[n地面co].c = 12000 - 1;
                n地面[n地面co].d = 3000;
                n地面[n地面co].type = 52;
                n地面[n地面co].xtype = 0;
                n地面co += 1;
                //
                n地面[n地面co].a = 51 * 29 * 100;
                n地面[n地面co].b = (4 * 29 - 12) * 100;
                n地面[n地面co].c = 9000 - 1;
                n地面[n地面co].d = 3000;
                n地面[n地面co].type = 51;
                n地面[n地面co].xtype = 0;
                n地面co += 1;
                //
                n地面[n地面co].a = 84 * 29 * 100;
                n地面[n地面co].b = (13 * 29 - 12) * 100;
                n地面[n地面co].c = 9000 - 1;
                n地面[n地面co].d = 3000;
                n地面[n地面co].type = 52;
                n地面[n地面co].xtype = 0;
                n地面co += 1;
                //
                n地面[n地面co].a = 105 * 29 * 100;
                n地面[n地面co].b = (13 * 29 - 12) * 100;
                n地面[n地面co].c = 15000 - 1;
                n地面[n地面co].d = 3000;
                n地面[n地面co].type = 52;
                n地面[n地面co].xtype = 0;
                n地面co += 1;
                //
                n敵出現co = 0;
                //
                n敵出現[n敵出現co].a = 6 * 29 * 100;
                n敵出現[n敵出現co].b = (3 * 29 - 12) * 100;
                n敵出現[n敵出現co].type = 80;
                n敵出現[n敵出現co].xtype = 0;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 13 * 29 * 100;
                n敵出現[n敵出現co].b = (6 * 29 - 12) * 100;
                n敵出現[n敵出現co].type = 4;
                n敵出現[n敵出現co].xtype = 1;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 23 * 29 * 100;
                n敵出現[n敵出現co].b = (7 * 29 - 12) * 100;
                n敵出現[n敵出現co].type = 80;
                n敵出現[n敵出現co].xtype = 0;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 25 * 29 * 100;
                n敵出現[n敵出現co].b = (7 * 29 - 12) * 100;
                n敵出現[n敵出現co].type = 80;
                n敵出現[n敵出現co].xtype = 1;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 27 * 29 * 100;
                n敵出現[n敵出現co].b = (7 * 29 - 12) * 100;
                n敵出現[n敵出現co].type = 80;
                n敵出現[n敵出現co].xtype = 0;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 88 * 29 * 100;
                n敵出現[n敵出現co].b = (12 * 29 - 12) * 100;
                n敵出現[n敵出現co].type = 82;
                n敵出現[n敵出現co].xtype = 1;
                n敵出現co += 1;
                //
                for (int tt_ = 0; tt_ <= 1000; tt_++)
                {
                    for (int t_ = 0; t_ <= 16; t_++)
                    {
                        stageDate[t_, tt_] = 0; stageDate[t_, tt_] = stagedatex[t_,tt_];
                    }
                }
            }

            if (nステージa == 2 && nステージb == 2 && nステージc == 0)
            {//2-2(地上)

                bgmChange(Res.nオーディオ100);
                nステージ色 = 1;
                scrollX = 2900 * (19 - 19);
                //
                var stagedatex = MapList.stagedatex10;
                //
                n地面[n地面co].a = 14 * 29 * 100 + 200;
                n地面[n地面co].b = -6000;
                n地面[n地面co].c = 5000;
                n地面[n地面co].d = 70000;
                n地面[n地面co].type = 100;
                n地面co += 1;
                //
                n地面[n地面co].a = 12 * 29 * 100 + 1200;
                n地面[n地面co].b = -6000;
                n地面[n地面co].c = 7000;
                n地面[n地面co].d = 70000;
                n地面[n地面co].type = 101;
                n地面co += 1;
                //
                n地面[n地面co].a = 12 * 29 * 100;
                n地面[n地面co].b = (13 * 29 - 12) * 100;
                n地面[n地面co].c = 6000 - 1;
                n地面[n地面co].d = 3000;
                n地面[n地面co].type = 52;
                n地面[n地面co].gtype  = 0;
                n地面co += 1;
                //
                n地面[n地面co].a = 14 * 29 * 100;
                n地面[n地面co].b = (9 * 29 - 12) * 100;
                n地面[n地面co].c = 6000;
                n地面[n地面co].d = 12000 - 200;
                n地面[n地面co].type = 50;
                n地面[n地面co].xtype = 1;
                n地面co += 1;
                //
                tyobi(6 * 29, 9 * 29 - 12, 110);
                //
                for (int tt_ = 0; tt_ <= 1000; tt_++)
                {
                    for (int t_ = 0; t_ <= 16; t_++)
                    {
                        stageDate[t_, tt_] = 0; stageDate[t_, tt_] = stagedatex[t_,tt_];
                    }
                }
            }

            if (nステージa == 2 && nステージb == 2 && nステージc == 1)
            {//2-2(地下)

                bgmChange(Res.nオーディオ103);
                nステージ色 = 2;
                ma = 7500; nプレイヤー.b = 9000;
                scrollX = 2900 * (137 - 19);
                //
                var stagedatex = MapList.stagedatex11;
                //
                n敵出現co = 0;
                n敵出現[n敵出現co].a = 32 * 29 * 100 - 1400;
                n敵出現[n敵出現co].b = (-2 * 29 - 12) * 100 + 500;
                n敵出現[n敵出現co].type = 86;
                n敵出現[n敵出現co].xtype = 0;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = (31 * 29 - 12) * 100;
                n敵出現[n敵出現co].b = (7 * 29 - 12) * 100;
                n敵出現[n敵出現co].type = 7;
                n敵出現[n敵出現co].xtype = 0;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 38 * 29 * 100 + 1500;
                n敵出現[n敵出現co].b = (6 * 29 - 12) * 100 + 1500;
                n敵出現[n敵出現co].type = 87;
                n敵出現[n敵出現co].xtype = 107;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 38 * 29 * 100 + 1500;
                n敵出現[n敵出現co].b = (6 * 29 - 12) * 100 + 1500;
                n敵出現[n敵出現co].type = 88;
                n敵出現[n敵出現co].xtype = 107;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 42 * 29 * 100 + 1500;
                n敵出現[n敵出現co].b = (6 * 29 - 12) * 100 + 1500;
                n敵出現[n敵出現co].type = 87;
                n敵出現[n敵出現co].xtype = 107;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 42 * 29 * 100 + 1500;
                n敵出現[n敵出現co].b = (6 * 29 - 12) * 100 + 1500;
                n敵出現[n敵出現co].type = 88;
                n敵出現[n敵出現co].xtype = 107;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 46 * 29 * 100 + 1500;
                n敵出現[n敵出現co].b = (6 * 29 - 12) * 100 + 1500;
                n敵出現[n敵出現co].type = 87;
                n敵出現[n敵出現co].xtype = 107;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 46 * 29 * 100 + 1500;
                n敵出現[n敵出現co].b = (6 * 29 - 12) * 100 + 1500;
                n敵出現[n敵出現co].type = 88;
                n敵出現[n敵出現co].xtype = 107;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 58 * 29 * 100;
                n敵出現[n敵出現co].b = (7 * 29 - 12) * 100;
                n敵出現[n敵出現co].type = 82;
                n敵出現[n敵出現co].xtype = 1;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 66 * 29 * 100;
                n敵出現[n敵出現co].b = (7 * 29 - 12) * 100;
                n敵出現[n敵出現co].type = 82;
                n敵出現[n敵出現co].xtype = 1;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 76 * 29 * 100 - 1400;
                n敵出現[n敵出現co].b = (-2 * 29 - 12) * 100 + 500;
                n敵出現[n敵出現co].type = 86;
                n敵出現[n敵出現co].xtype = 0;
                n敵出現co += 1;
                //
                n地面co = 0;
                n地面[n地面co].a = 2 * 29 * 100;
                n地面[n地面co].b = (13 * 29 - 12) * 100;
                n地面[n地面co].c = 300000 - 6001;
                n地面[n地面co].d = 3000;
                n地面[n地面co].type = 52;
                n地面[n地面co].xtype = 0;
                n地面co += 1;
                //
                n地面[n地面co].a = 3 * 29 * 100;
                n地面[n地面co].b = (7 * 29 - 12) * 100;
                n地面[n地面co].c = 3000;
                n地面[n地面co].d = 3000;
                n地面[n地面co].type = 105;
                n地面[n地面co].xtype = 0;
                n地面co += 1;
                //
                n地面[n地面co].a = 107 * 29 * 100;
                n地面[n地面co].b = (9 * 29 - 12) * 100;
                n地面[n地面co].c = 9000 - 1;
                n地面[n地面co].d = 24000;
                n地面[n地面co].type = 52;
                n地面[n地面co].xtype = 1;
                n地面co += 1;
                //
                n地面[n地面co].a = 111 * 29 * 100;
                n地面[n地面co].b = (7 * 29 - 12) * 100;
                n地面[n地面co].c = 3000;
                n地面[n地面co].d = 6000 - 200;
                n地面[n地面co].type = 40;
                n地面[n地面co].xtype = 0;
                n地面co += 1;
                //
                n地面[n地面co].a = 113 * 29 * 100 + 1100;
                n地面[n地面co].b = (0 * 29 - 12) * 100;
                n地面[n地面co].c = 4700;
                n地面[n地面co].d = 27000 - 1000;
                n地面[n地面co].type = 0;
                n地面[n地面co].xtype = 0;
                n地面co += 1;
                //
                n地面[n地面co].a = 128 * 29 * 100;
                n地面[n地面co].b = (9 * 29 - 12) * 100;
                n地面[n地面co].c = 9000 - 1;
                n地面[n地面co].d = 24000;
                n地面[n地面co].type = 52;
                n地面[n地面co].xtype = 1;
                n地面co += 1;
                //
                n地面[n地面co].a = 131 * 29 * 100;
                n地面[n地面co].b = (9 * 29 - 12) * 100;
                n地面[n地面co].c = 3000;
                n地面[n地面co].d = 6000 - 200;
                n地面[n地面co].type = 40;
                n地面[n地面co].xtype = 2;
                n地面co += 1;
                //
                n地面[n地面co].a = 133 * 29 * 100 + 1100;
                n地面[n地面co].b = (0 * 29 - 12) * 100;
                n地面[n地面co].c = 4700;
                n地面[n地面co].d = 32000;
                n地面[n地面co].type = 0;
                n地面[n地面co].xtype = 0;
                n地面co += 1;
                //
                nブロックco = 0;
                nブロック[nブロックco].xtype = 0;

                tyobi(0 * 29, 0 * 29 - 12, 4);
                nブロックco = 1;
                nブロック[nブロックco].xtype = 0;

                tyobi(2 * 29, 9 * 29 - 12, 4);
                nブロックco = 2;
                nブロック[nブロックco].xtype = 0;

                tyobi(3 * 29, 9 * 29 - 12, 4);
                nブロックco += 1;
                //
                nブロック[nブロックco].xtype = 1;

                tyobi(5 * 29, 9 * 29 - 12, 115);
                nブロックco += 1;
                nブロック[nブロックco].xtype = 1;

                tyobi(6 * 29, 9 * 29 - 12, 115);
                nブロックco += 1;
                //
                nブロック[nブロックco].xtype = 1;

                tyobi(5 * 29, 10 * 29 - 12, 115);
                nブロックco += 1;
                nブロック[nブロックco].xtype = 1;

                tyobi(6 * 29, 10 * 29 - 12, 115);
                nブロックco += 1;
                //
                nブロック[nブロックco].xtype = 1;

                tyobi(5 * 29, 11 * 29 - 12, 115);
                nブロックco += 1;
                nブロック[nブロックco].xtype = 1;

                tyobi(6 * 29, 11 * 29 - 12, 115);
                nブロックco += 1;
                //
                nブロック[nブロックco].xtype = 1;

                tyobi(5 * 29, 12 * 29 - 12, 115);
                nブロックco += 1;
                nブロック[nブロックco].xtype = 1;

                tyobi(6 * 29, 12 * 29 - 12, 115);
                nブロックco += 1;
                //
                nブロック[nブロックco].xtype = 1;

                tyobi(70 * 29, 7 * 29 - 12, 115);
                nブロックco += 1;
                nブロック[nブロックco].xtype = 1;

                tyobi(71 * 29, 7 * 29 - 12, 115);
                nブロックco += 1;
                //
                for (int tt_ = 0; tt_ <= 1000; tt_++)
                {
                    for (int t_ = 0; t_ <= 16; t_++)
                    {
                        stageDate[t_, tt_] = 0; stageDate[t_, tt_] = stagedatex[t_,tt_];
                    }
                }
            }

            if (nステージa == 2 && nステージb == 2 && nステージc == 2)
            {// 2-2 地上
             //
                bgmChange(Res.nオーディオ100);
                nステージ色 = 1;
                scrollX = 2900 * (36 - 19);
                ma = 7500;
                nプレイヤー.b = 3000 * 9;
                //
                var stagedatex = MapList.stagedatex12;
                //
                n敵出現co = 0;
                n敵出現[n敵出現co].a = 9 * 29 * 100;
                n敵出現[n敵出現co].b = (12 * 29 - 12) * 100;
                n敵出現[n敵出現co].type = 82;
                n敵出現[n敵出現co].xtype = 1;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 10 * 29 * 100;
                n敵出現[n敵出現co].b = (11 * 29 - 12) * 100;
                n敵出現[n敵出現co].type = 82;
                n敵出現[n敵出現co].xtype = 1;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 11 * 29 * 100;
                n敵出現[n敵出現co].b = (10 * 29 - 12) * 100;
                n敵出現[n敵出現co].type = 82;
                n敵出現[n敵出現co].xtype = 1;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 12 * 29 * 100;
                n敵出現[n敵出現co].b = (9 * 29 - 12) * 100;
                n敵出現[n敵出現co].type = 82;
                n敵出現[n敵出現co].xtype = 1;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 13 * 29 * 100;
                n敵出現[n敵出現co].b = (8 * 29 - 12) * 100;
                n敵出現[n敵出現co].type = 82;
                n敵出現[n敵出現co].xtype = 1;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 14 * 29 * 100;
                n敵出現[n敵出現co].b = (7 * 29 - 12) * 100;
                n敵出現[n敵出現co].type = 82;
                n敵出現[n敵出現co].xtype = 1;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 15 * 29 * 100;
                n敵出現[n敵出現co].b = (6 * 29 - 12) * 100;
                n敵出現[n敵出現co].type = 82;
                n敵出現[n敵出現co].xtype = 1;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 16 * 29 * 100;
                n敵出現[n敵出現co].b = (5 * 29 - 12) * 100;
                n敵出現[n敵出現co].type = 82;
                n敵出現[n敵出現co].xtype = 1;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 17 * 29 * 100;
                n敵出現[n敵出現co].b = (5 * 29 - 12) * 100;
                n敵出現[n敵出現co].type = 82;
                n敵出現[n敵出現co].xtype = 1;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 18 * 29 * 100;
                n敵出現[n敵出現co].b = (5 * 29 - 12) * 100;
                n敵出現[n敵出現co].type = 82;
                n敵出現[n敵出現co].xtype = 1;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 19 * 29 * 100;
                n敵出現[n敵出現co].b = (5 * 29 - 12) * 100;
                n敵出現[n敵出現co].type = 82;
                n敵出現[n敵出現co].xtype = 1;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 20 * 29 * 100;
                n敵出現[n敵出現co].b = (5 * 29 - 12) * 100;
                n敵出現[n敵出現co].type = 82;
                n敵出現[n敵出現co].xtype = 1;
                n敵出現co += 1;
                //
                for (int tt_ = 0; tt_ <= 1000; tt_++)
                {
                    for (int t_ = 0; t_ <= 16; t_++)
                    {
                        stageDate[t_, tt_] = 0; stageDate[t_, tt_] = stagedatex[t_,tt_];
                    }
                }
            }
            //
            if (nステージa == 2 && nステージb == 3 && nステージc == 0)
            {// 2-3
                ma = 7500;
                nプレイヤー.b = 3000 * 8;

                bgmChange(Res.nオーディオ100);
                nステージ色 = 1;
                scrollX = 2900 * (126 - 19);
                //
                var stagedatex = MapList.stagedatex13;
                //
                nブロックco = 0;
                nブロック[nブロックco].xtype = 0;
                for (int i = -1; i > -7; i -= 1)
                {

                    tyobi(55 * 29, i * 29 - 12, 4);
                    nブロックco += 1;
                }
                //
                nブロック[nブロックco].xtype = 0;

                tyobi(64 * 29, 12 * 29 - 12, 120);
                nブロックco += 1;
                //
                nブロック[nブロックco].xtype = 1;

                tyobi(66 * 29, 3 * 29 - 12, 115);
                nブロックco += 1;
                //
                nブロック[nブロックco].xtype = 1;

                tyobi(67 * 29, 3 * 29 - 12, 115);
                nブロックco += 1;
                //
                nブロック[nブロックco].xtype = 1;

                tyobi(68 * 29, 3 * 29 - 12, 115);
                nブロックco += 1;
                //
                nブロック[nブロックco].xtype = 8;

                tyobi(60 * 29, 6 * 29 - 12, 300);
                nブロックco += 1;
                n敵出現co = 1;
                n敵出現[n敵出現co].a = (54 * 29 - 12) * 100;
                n敵出現[n敵出現co].b = (1 * 29 - 12) * 100;
                n敵出現[n敵出現co].type = 80;
                n敵出現[n敵出現co].xtype = 0;
                n敵出現co += 1;
                //
                n地面co = 0;
                n敵出現[n地面co].a = (102 * 29 - 12) * 100;
                n敵出現[n地面co].b = (10 * 29 - 12) * 100;
                n敵出現[n地面co].type = 50;
                n敵出現[n地面co].xtype = 1;
                n地面co += 1;
                //
                nリフトco = 0;
                nリフト[nリフトco].a = 1 * 29 * 100;
                nリフト[nリフトco].b = (10 * 29 - 12) * 100;
                nリフト[nリフトco].c = 5 * 3000;
                nリフト[nリフトco].type = 0;
                nリフト[nリフトco].acttype = 1;
                nリフト[nリフトco].e = 0;
                nリフト[nリフトco].sp = 10;
                nリフトco++;
                //
                nリフト[nリフトco].a = 18 * 29 * 100;
                nリフト[nリフトco].b = (4 * 29 - 12) * 100;
                nリフト[nリフトco].c = 3 * 3000;
                nリフト[nリフトco].type = 0;
                nリフト[nリフトco].acttype = 0;
                nリフト[nリフトco].e = 0;
                nリフト[nリフトco].sp = 10;
                nリフトco++;
                //
                nリフト[nリフトco].a = 35 * 29 * 100;
                nリフト[nリフトco].b = (4 * 29 - 12) * 100;
                nリフト[nリフトco].c = 5 * 3000;
                nリフト[nリフトco].type = 0;
                nリフト[nリフトco].acttype = 0;
                nリフト[nリフトco].e = 0;
                nリフト[nリフトco].sp = 10;
                nリフトco++;
                //
                nリフト[nリフトco].a = 35 * 29 * 100;
                nリフト[nリフトco].b = (8 * 29 - 12) * 100;
                nリフト[nリフトco].c = 5 * 3000;
                nリフト[nリフトco].type = 0;
                nリフト[nリフトco].acttype = 0;
                nリフト[nリフトco].e = 0;
                nリフト[nリフトco].sp = 10;
                nリフトco++;
                //
                nリフト[nリフトco].a = 94 * 29 * 100;
                nリフト[nリフトco].b = (6 * 29 - 12) * 100;
                nリフト[nリフトco].c = 3 * 3000;
                nリフト[nリフトco].type = 0;
                nリフト[nリフトco].acttype = 0;
                nリフト[nリフトco].e = 0;
                nリフト[nリフトco].sp = 1;
                nリフトco++;
                //
                for (int tt_ = 0; tt_ <= 1000; tt_++)
                {
                    for (int t_ = 0; t_ <= 16; t_++)
                    {
                        stageDate[t_, tt_] = 0; stageDate[t_, tt_] = stagedatex[t_,tt_];
                    }
                }
            }
            //
            if (nステージa == 2 && nステージb == 4 && (nステージc == 0 || nステージc == 10 || nステージc == 12))
            {// 2-4(1番)
                if (nステージc == 0)
                {
                    ma = 7500;
                    nプレイヤー.b = 3000 * 4;
                }
                else {
                    ma = 19500;
                    nプレイヤー.b = 3000 * 11;
                    nステージc = 0;
                }

                bgmChange(Res.nオーディオ105);
                nステージ色 = 4;
                scrollX = 2900 * (40 - 19);
                //
                var stagedatex = MapList.stagedatex14;
                //
                nブロックco = 0;
                nブロック[nブロックco].xtype = 0;

                tyobi(0 * 29, -1 * 29 - 12, 5);
                nブロックco += 1;
                //
                nブロック[nブロックco].xtype = 0;

                tyobi(4 * 29, -1 * 29 - 12, 5);
                nブロックco += 1;
                //
                nブロック[nブロックco].xtype = 0;

                tyobi(1 * 29, 14 * 29 - 12, 5);
                nブロックco += 1;
                //
                nブロック[nブロックco].xtype = 0;

                tyobi(6 * 29, 14 * 29 - 12, 5);
                nブロックco += 1;
                //
                nブロック[nブロックco].xtype = 0;

                tyobi(7 * 29, 14 * 29 - 12, 5);
                nブロックco += 1;
                //
                n敵出現co = 0;
                n敵出現[n敵出現co].a = 2 * 29 * 100 - 1400;
                n敵出現[n敵出現co].b = (-2 * 29 - 12) * 100 + 500;
                n敵出現[n敵出現co].type = 86;
                n敵出現[n敵出現co].xtype = 0;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 20 * 29 * 100 + 1500;
                n敵出現[n敵出現co].b = (5 * 29 - 12) * 100 + 1500;
                n敵出現[n敵出現co].type = 87;
                n敵出現[n敵出現co].xtype = 107;
                n敵出現co += 1;
                //
                n地面co = 0;
                n地面[n地面co].a = 17 * 29 * 100;
                n地面[n地面co].b = (9 * 29 - 12) * 100;
                n地面[n地面co].c = 21000 - 1;
                n地面[n地面co].d = 3000 - 1;
                n地面[n地面co].type = 52;
                n地面[n地面co].xtype = 2;
                n地面co += 1;
                //
                n地面[n地面co].a = 27 * 29 * 100;
                n地面[n地面co].b = (13 * 29 - 12) * 100;
                n地面[n地面co].c = 6000;
                n地面[n地面co].d = 6000;
                n地面[n地面co].type = 50;
                n地面[n地面co].xtype = 6;
                n地面co += 1;
                //
                n地面[n地面co].a = 34 * 29 * 100;
                n地面[n地面co].b = (5 * 29 - 12) * 100;
                n地面[n地面co].c = 6000;
                n地面[n地面co].d = 30000;
                n地面[n地面co].type = 50;
                n地面[n地面co].xtype = 1;
                n地面co += 1;
                //
                for (int tt_ = 0; tt_ <= 1000; tt_++)
                {
                    for (int t_ = 0; t_ <= 16; t_++)
                    {
                        stageDate[t_, tt_] = 0; stageDate[t_, tt_] = stagedatex[t_,tt_];
                    }
                }
            }

            if (nステージa == 2 && nステージb == 4 && nステージc == 1)
            {// 2-4(2番)
                ma = 4500;
                nプレイヤー.b = 3000 * 11;

                bgmChange(Res.nオーディオ105);
                nステージ色 = 4;
                scrollX = 2900 * (21 - 19);
                //
                var stagedatex = MapList.stagedatex15;
                //
                nブロックco = 0;
                nブロック[nブロックco].xtype = 1;

                tyobi(12 * 29, 13 * 29 - 12, 115);
                nブロックco += 1;
                //
                nブロック[nブロックco].xtype = 1;

                tyobi(13 * 29, 13 * 29 - 12, 115);
                nブロックco += 1;
                //
                nブロック[nブロックco].xtype = 1;

                tyobi(14 * 29, 13 * 29 - 12, 115);
                nブロックco += 1;
                //
                n地面co = 0;
                n地面[n地面co].a = 6 * 29 * 100;
                n地面[n地面co].b = (6 * 29 - 12) * 100;
                n地面[n地面co].c = 18000 - 1;
                n地面[n地面co].d = 6000 - 1;
                n地面[n地面co].type = 52;
                n地面[n地面co].xtype = 0;
                n地面co += 1;
                //
                n地面[n地面co].a = 12 * 29 * 100;
                n地面[n地面co].b = (8 * 29 - 12) * 100;
                n地面[n地面co].c = 9000 - 1;
                n地面[n地面co].d = 3000 - 1;
                n地面[n地面co].type = 52;
                n地面[n地面co].xtype = 2;
                n地面co += 1;
                //
                n地面[n地面co].a = 15 * 29 * 100;
                n地面[n地面co].b = (11 * 29 - 12) * 100;
                n地面[n地面co].c = 3000;
                n地面[n地面co].d = 6000;
                n地面[n地面co].type = 40;
                n地面[n地面co].xtype = 2;
                n地面co += 1;
                //
                n地面[n地面co].a = 17 * 29 * 100 + 1100;
                n地面[n地面co].b = (0 * 29 - 12) * 100;
                n地面[n地面co].c = 4700;
                n地面[n地面co].d = 38000;
                n地面[n地面co].type = 0;
                n地面[n地面co].xtype = 0;
                n地面co += 1;
                //
                for (int tt_ = 0; tt_ <= 1000; tt_++)
                {
                    for (int t_ = 0; t_ <= 16; t_++)
                    {
                        stageDate[t_, tt_] = 0; stageDate[t_, tt_] = stagedatex[t_,tt_];
                    }
                }
            }

            if (nステージa == 2 && nステージb == 4 && nステージc == 2)
            {// 2-4(3番)
                ma = 4500;
                nプレイヤー.b = 3000 * 11;

                bgmChange(Res.nオーディオ105);
                nステージ色 = 4;
                scrollX = 2900 * (128 - 19);
                //
                var stagedatex = MapList.stagedatex16;
                //
                nブロックco = 0;
                nブロック[nブロックco].xtype = 0;

                tyobi(1 * 29, 14 * 29 - 12, 5);
                nブロックco += 1;
                //
                nブロック[nブロックco].xtype = 0;

                tyobi(2 * 29, 14 * 29 - 12, 5);
                nブロックco += 1;
                //
                nブロック[nブロックco].xtype = 9;

                tyobi(3 * 29, 4 * 29 - 12, 300);
                nブロックco += 1;
                //
                nブロック[nブロックco].xtype = 1;

                tyobi(32 * 29, 9 * 29 - 12, 115);
                nブロックco += 1;
                //
                nブロック[nブロックco].xtype = 0;

                tyobi(76 * 29, 14 * 29 - 12, 5);
                nブロックco += 1;
                //
                nブロック[nブロックco].xtype = 0;

                tyobi(108 * 29, 11 * 29 - 12, 141);
                nブロックco += 1;
                //
                nブロック[nブロックco].xtype = 0;

                tyobi(109 * 29, 10 * 29 - 12 - 3, 140);
                nブロックco += 1;
                //
                nブロック[nブロックco].xtype = 0;

                tyobi(121 * 29, 10 * 29 - 12, 142);
                nブロックco += 1;
                //
                n敵出現co = 0;
                n敵出現[n敵出現co].a = 0 * 29 * 100 + 1500;
                n敵出現[n敵出現co].b = (8 * 29 - 12) * 100 + 1500;
                n敵出現[n敵出現co].type = 88;
                n敵出現[n敵出現co].xtype = 105;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 2 * 29 * 100;
                n敵出現[n敵出現co].b = (0 * 29 - 12) * 100;
                n敵出現[n敵出現co].type = 80;
                n敵出現[n敵出現co].xtype = 1;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 3 * 29 * 100 + 1500;
                n敵出現[n敵出現co].b = (8 * 29 - 12) * 100 + 1500;
                n敵出現[n敵出現co].type = 87;
                n敵出現[n敵出現co].xtype = 105;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 6 * 29 * 100 + 1500;
                n敵出現[n敵出現co].b = (8 * 29 - 12) * 100 + 1500;
                n敵出現[n敵出現co].type = 88;
                n敵出現[n敵出現co].xtype = 107;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 9 * 29 * 100 + 1500;
                n敵出現[n敵出現co].b = (8 * 29 - 12) * 100 + 1500;
                n敵出現[n敵出現co].type = 88;
                n敵出現[n敵出現co].xtype = 107;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 25 * 29 * 100 - 1400;
                n敵出現[n敵出現co].b = (2 * 29 - 12) * 100 - 400;
                n敵出現[n敵出現co].type = 86;
                n敵出現[n敵出現co].xtype = 0;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 40 * 29 * 100;
                n敵出現[n敵出現co].b = (8 * 29 - 12) * 100;
                n敵出現[n敵出現co].type = 82;
                n敵出現[n敵出現co].xtype = 0;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 42 * 29 * 100;
                n敵出現[n敵出現co].b = (8 * 29 - 12) * 100;
                n敵出現[n敵出現co].type = 82;
                n敵出現[n敵出現co].xtype = 0;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 43 * 29 * 100 + 1500;
                n敵出現[n敵出現co].b = (6 * 29 - 12) * 100 + 1500;
                n敵出現[n敵出現co].type = 88;
                n敵出現[n敵出現co].xtype = 105;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 47 * 29 * 100 + 1500;
                n敵出現[n敵出現co].b = (6 * 29 - 12) * 100 + 1500;
                n敵出現[n敵出現co].type = 87;
                n敵出現[n敵出現co].xtype = 105;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 57 * 29 * 100;
                n敵出現[n敵出現co].b = (7 * 29 - 12) * 100;
                n敵出現[n敵出現co].type = 82;
                n敵出現[n敵出現co].xtype = 0;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 77 * 29 * 100 - 1400;
                n敵出現[n敵出現co].b = (2 * 29 - 12) * 100 - 400;
                n敵出現[n敵出現co].type = 86;
                n敵出現[n敵出現co].xtype = 0;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 83 * 29 * 100 - 1400;
                n敵出現[n敵出現co].b = (2 * 29 - 12) * 100 - 400;
                n敵出現[n敵出現co].type = 86;
                n敵出現[n敵出現co].xtype = 0;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 88 * 29 * 100 + 1500;
                n敵出現[n敵出現co].b = (9 * 29 - 12) * 100 + 1500;
                n敵出現[n敵出現co].type = 87;
                n敵出現[n敵出現co].xtype = 105;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 88 * 29 * 100 + 1500;
                n敵出現[n敵出現co].b = (9 * 29 - 12) * 100 + 1500;
                n敵出現[n敵出現co].type = 88;
                n敵出現[n敵出現co].xtype = 105;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 90 * 29 * 100;
                n敵出現[n敵出現co].b = (9 * 29 - 12) * 100;
                n敵出現[n敵出現co].type = 82;
                n敵出現[n敵出現co].xtype = 0;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 107 * 29 * 100;
                n敵出現[n敵出現co].b = (10 * 29 - 12) * 100;
                n敵出現[n敵出現co].type = 30;
                n敵出現[n敵出現co].xtype = 0;
                n敵出現co += 1;
                //
                n地面co = 0;
                n地面[n地面co].a = 13 * 29 * 100;
                n地面[n地面co].b = (8 * 29 - 12) * 100;
                n地面[n地面co].c = 33000 - 1;
                n地面[n地面co].d = 3000 - 1;
                n地面[n地面co].type = 52;
                n地面[n地面co].xtype = 2;
                n地面co += 1;
                //
                n地面[n地面co].a = 13 * 29 * 100;
                n地面[n地面co].b = (0 * 29 - 12) * 100;
                n地面[n地面co].c = 33000 - 1;
                n地面[n地面co].d = 3000 - 1;
                n地面[n地面co].type = 51;
                n地面[n地面co].xtype = 3;
                n地面co += 1;
                //
                n地面[n地面co].a = 10 * 29 * 100;
                n地面[n地面co].b = (13 * 29 - 12) * 100;
                n地面[n地面co].c = 6000;
                n地面[n地面co].d = 6000;
                n地面[n地面co].type = 50;
                n地面[n地面co].xtype = 6;
                n地面co += 1;
                //
                n地面[n地面co].a = 46 * 29 * 100;
                n地面[n地面co].b = (12 * 29 - 12) * 100;
                n地面[n地面co].c = 9000 - 1;
                n地面[n地面co].d = 3000 - 1;
                n地面[n地面co].type = 52;
                n地面[n地面co].xtype = 2;
                n地面co += 1;
                //
                n地面[n地面co].a = 58 * 29 * 100;
                n地面[n地面co].b = (13 * 29 - 12) * 100;
                n地面[n地面co].c = 6000;
                n地面[n地面co].d = 6000;
                n地面[n地面co].type = 50;
                n地面[n地面co].xtype = 6;
                n地面co += 1;
                //
                n地面[n地面co].a = 101 * 29 * 100 - 1500;
                n地面[n地面co].b = (10 * 29 - 12) * 100 - 3000;
                n地面[n地面co].c = 12000;
                n地面[n地面co].d = 12000;
                n地面[n地面co].type = 104;
                n地面[n地面co].xtype = 0;
                n地面co += 1;
                //
                n地面[n地面co].a = 102 * 29 * 100 + 3000;
                n地面[n地面co].b = (2 * 29 - 12) * 100;
                n地面[n地面co].c = 3000 - 1;
                n地面[n地面co].d = 300000;
                n地面[n地面co].type = 102;
                n地面[n地面co].xtype = 20;
                n地面co += 1;
                //
                nリフトco = 0;
                nリフト[nリフトco].a = 74 * 29 * 100 - 1500;
                nリフト[nリフトco].b = (7 * 29 - 12) * 100;
                nリフト[nリフトco].c = 2 * 3000;
                nリフト[nリフトco].type = 0;
                nリフト[nリフトco].acttype = 1;
                nリフト[nリフトco].e = 0;
                nリフト[nリフトco].sp = 0;
                nリフトco = 20;
                //
                nリフト[nリフトco].a = 97 * 29 * 100;
                nリフト[nリフトco].b = (12 * 29 - 12) * 100;
                nリフト[nリフトco].c = 12 * 3000;
                nリフト[nリフトco].type = 0;
                nリフト[nリフトco].acttype = 0;
                nリフト[nリフトco].e = 0;
                nリフト[nリフトco].sp = 21;
                nリフトco += 1;
                //
                for (int tt_ = 0; tt_ <= 1000; tt_++)
                {
                    for (int t_ = 0; t_ <= 16; t_++)
                    {
                        stageDate[t_, tt_] = 0; stageDate[t_, tt_] = stagedatex[t_,tt_];
                    }
                }
            }

            if (nステージa == 3 && nステージb == 1 && nステージc == 0)
            {// 3-1
                ma = 5600;
                nプレイヤー.b = 32000;

                bgmChange(Res.nオーディオ100);
                nステージ色 = 5;
                scrollX = 2900 * (112 - 19);
                var stagedatex = MapList.stagedatex17;
                //追加情報
                nブロックco = 0;
                //
                nブロック[nブロックco].xtype = 10;

                tyobi(2 * 29, 9 * 29 - 12, 300);
                nブロックco += 1;
                //
                nブロック[nブロックco].xtype = 1;

                tyobi(63 * 29, 13 * 29 - 12, 115);
                nブロックco += 1;
                //
                nブロック[nブロックco].xtype = 1;

                tyobi(64 * 29, 13 * 29 - 12, 115);
                nブロックco += 1;
                //
                n地面co = 0;
                n地面[n地面co].a = 13 * 29 * 100;
                n地面[n地面co].b = (13 * 29 - 12) * 100;
                n地面[n地面co].c = 9000 - 1;
                n地面[n地面co].d = 3000;
                n地面[n地面co].type = 52;
                n地面[n地面co].xtype = 0;
                n地面co += 1;
                //
                n地面[n地面co].a = 84 * 29 * 100;
                n地面[n地面co].b = (13 * 29 - 12) * 100;
                n地面[n地面co].c = 9000 - 1;
                n地面[n地面co].d = 3000;
                n地面[n地面co].type = 52;
                n地面[n地面co].xtype = 0;
                n地面co += 1;
                //
                n敵出現co = 0;
                n敵出現[n敵出現co].a = 108 * 29 * 100;
                n敵出現[n敵出現co].b = (6 * 29 - 12) * 100;
                n敵出現[n敵出現co].type = 6;
                n敵出現[n敵出現co].xtype = 1;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 33 * 29 * 100;
                n敵出現[n敵出現co].b = (10 * 29 - 12) * 100;
                n敵出現[n敵出現co].type = 82;
                n敵出現[n敵出現co].xtype = 1;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 36 * 29 * 100;
                n敵出現[n敵出現co].b = (0 * 29 - 12) * 100;
                n敵出現[n敵出現co].type = 80;
                n敵出現[n敵出現co].xtype = 1;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 78 * 29 * 100 + 1500;
                n敵出現[n敵出現co].b = (7 * 29 - 12) * 100 + 1500;
                n敵出現[n敵出現co].type = 88;
                n敵出現[n敵出現co].xtype = 105;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 80 * 29 * 100 + 1500;
                n敵出現[n敵出現co].b = (7 * 29 - 12) * 100 + 1500;
                n敵出現[n敵出現co].type = 87;
                n敵出現[n敵出現co].xtype = 105;
                n敵出現co += 1;
                //
                n敵出現[n敵出現co].a = 85 * 29 * 100;
                n敵出現[n敵出現co].b = (11 * 29 - 12) * 100;
                n敵出現[n敵出現co].type = 82;
                n敵出現[n敵出現co].xtype = 1;
                n敵出現co += 1;
                //
                nリフトco = 0;
                nリフト[nリフトco].a = 41 * 29 * 100;
                nリフト[nリフトco].b = (3 * 29 - 12) * 100;
                nリフト[nリフトco].c = 3 * 3000;
                nリフト[nリフトco].type = 0;
                nリフト[nリフトco].acttype = 0;
                nリフト[nリフトco].e = 0;
                nリフト[nリフトco].sp = 3;
                nリフトco = 0;
                //
                for (int tt_ = 0; tt_ <= 1000; tt_++)
                {
                    for (int t_ = 0; t_ <= 16; t_++)
                    {
                        stageDate[t_, tt_] = 0; stageDate[t_, tt_] = stagedatex[t_,tt_];
                    }
                }
            }
        }
    }
}
